List<Map<String, String>> vaccinationCat = [
  {
    'age': '6 ',
    'vaccine': 'ถ่ายพยาธิ และตรวจสุขภาพ',
    'dose': ' - ',
  },
  {
    'age': '8-9',
    'vaccine': 'วัคซีนรวมป้องกันโรคแมว',
    'dose': 'เข็มที่ 1',
  },
  {
    'age': '10-12',
    'vaccine': 'วัคซีนรวมป้องกันโรคแมว',
    'dose': 'เข็มที่ 2',
  },
  {
    'age': '10-12',
    'vaccine': 'วัคซีนป้องกันโรคลิวคีเมีย',
    'dose': 'เข็มที่ 1',
  },
  {
    'age': '12',
    'vaccine': 'วัคซีนป้องกันโรคพิษสุนัขบ้า',
    'dose': 'เข็มที่ 1',
  },
  {
    'age': '14-16',
    'vaccine': 'วัคซีนรวมป้องกันโรคแมว',
    'dose': 'เข็มที่ 3',
  },
  {
    'age': '14-16',
    'vaccine': 'วัคซีนป้องกันโรคลิวคีเมีย',
    'dose': 'เข็มที่ 2',
  },
  {
    'age': 'ทุกเดือน',
    'vaccine': 'ป้องกันเห็บหมัดและพยาธิหนอนหัวใจ',
    'dose': ' - ',
  },
  {
    'age': 'ทุก 3 เดือน',
    'vaccine': 'ถ่ายพยาธิ',
    'dose': ' - ',
  },
];

List<Map<String, String>> vaccinationDog = [
  {
    'age': '6 ',
    'vaccine': 'ถ่ายพยาธิ และตรวจสุขภาพ',
    'dose': ' - ',
  },
  {
    'age': '8 ',
    'vaccine': 'วัคซีนสุนัขรวม 5 โรค',
    'dose': 'เข็มที่ 1',
  },
  {
    'age': '12',
    'vaccine': 'วัคซีนสุนัขรวม 5 โรค',
    'dose': 'เข็มที่ 2',
  },
  {
    'age': '12',
    'vaccine': 'วัคซีนป้องกันพิษสุนัขบ้า',
    'dose': 'เข็มที่ 1',
  },
  {
    'age': '16',
    'vaccine': 'วัคซีนสุนัขรวม 5 โรค',
    'dose': 'เข็มที่ 3',
  },
  {
    'age': '16',
    'vaccine': 'วัคซีนป้องกันพิษสุนัขบ้า',
    'dose': 'เข็มที่ 2',
  },
];

List<Map<String, String>> vac_Cat = [
  {
    'vaccine': 'ถ่ายพยาธิ และตรวจสุขภาพ 1',
  },
  {
    'vaccine': 'วัคซีนรวมป้องกันโรคแมว เข็ม 1',
  },
  {
    'vaccine': 'วัคซีนรวมป้องกันโรคแมว เข็ม 2',
  },
  {
    'vaccine': 'วัคซีนรวมป้องกันโรคแมว เข็ม 3',
  },
  {
    'vaccine': 'วัคซีนป้องกันโรคลิวคีเมีย เข็ม 1',
  },
  {
    'vaccine': 'วัคซีนป้องกันโรคลิวคีเมีย เข็ม 2',
  },
  {
    'vaccine': 'วัคซีนป้องกันโรคพิษสุนัขบ้า เข็ม 1',
  },
];

List<Map<String, String>> vac_Dog = [
  {
    'vaccine': 'ถ่ายพยาธิ และตรวจสุขภาพ 1',
  },
  {
    'vaccine': 'วัคซีนสุนัขรวม 5 โรค เข็ม 1',
  },
  {
    'vaccine': 'วัคซีนสุนัขรวม 5 โรค เข็ม 2',
  },
  {
    'vaccine': 'วัคซีนสุนัขรวม 5 โรค เข็ม 3',
  },
  {
    'vaccine': 'วัคซีนป้องกันโรคพิษสุนัขบ้า เข็ม 1',
  },
  {
    'vaccine': 'วัคซีนป้องกันโรคพิษสุนัขบ้า เข็ม 2',
  },
];

List<Map<String, String>> vaccinationCat_Table = [
  {
    'vaccine': 'ถ่ายพยาธิ และตรวจสุขภาพ',
    'dose': '1',
  },
  {
    'vaccine': 'วัคซีนรวมป้องกันโรคแมว',
    'dose': 'เข็ม 1',
  },
  {
    'vaccine': 'วัคซีนรวมป้องกันโรคแมว',
    'dose': 'เข็ม 2',
  },
  {
    'vaccine': 'วัคซีนป้องกันโรคลิวคีเมีย',
    'dose': 'เข็ม 1',
  },
  {
    'vaccine': 'วัคซีนป้องกันโรคพิษสุนัขบ้า',
    'dose': 'เข็ม 1',
  },
  {
    'vaccine': 'วัคซีนรวมป้องกันโรคแมว',
    'dose': 'เข็ม 3',
  },
  {
    'vaccine': 'วัคซีนป้องกันโรคลิวคีเมีย',
    'dose': 'เข็ม 2',
  },
];

List<Map<String, String>> vaccinationDog_Table = [
  {
    'vaccine': 'ถ่ายพยาธิ และตรวจสุขภาพ',
    'dose': '1',
  },
  {
    'vaccine': 'วัคซีนสุนัขรวม 5 โรค',
    'dose': 'เข็ม 1',
  },
  {
    'vaccine': 'วัคซีนสุนัขรวม 5 โรค',
    'dose': 'เข็ม 2',
  },
  {
    'vaccine': 'วัคซีนป้องกันพิษสุนัขบ้า',
    'dose': 'เข็ม 1',
  },
  {
    'vaccine': 'วัคซีนสุนัขรวม 5 โรค',
    'dose': 'เข็ม 3',
  },
  {
    'vaccine': 'วัคซีนป้องกันพิษสุนัขบ้า',
    'dose': 'เข็ม 2',
  },
];
