List<Map<String, String>> vaccinationCat = [
  {
    'age': '6 ',
    'vaccine': 'ถ่ายพยาธิ และตรวจสุขภาพ',
    'dose': ' - ',
  },
  {
    'age': '8-9',
    'vaccine': 'วัคซีนรวมป้องกันโรคแมว',
    'dose': 'เข็มที่ 1',
  },
  {
    'age': '10-12',
    'vaccine': 'วัคซีนรวมป้องกันโรคแมว',
    'dose': 'เข็มที่ 2',
  },
  {
    'age': '10-12',
    'vaccine': 'วัคซีนป้องกันโรคลิวคีเมีย',
    'dose': 'เข็มที่ 1',
  },
  {
    'age': '12',
    'vaccine': 'วัคซีนป้องกันโรคพิษสุนัขบ้า',
    'dose': 'เข็มที่ 1',
  },
  {
    'age': '14-16',
    'vaccine': 'วัคซีนรวมป้องกันโรคแมว',
    'dose': 'เข็มที่ 3',
  },
  {
    'age': '14-16',
    'vaccine': 'วัคซีนป้องกันโรคลิวคีเมีย',
    'dose': 'เข็มที่ 2',
  },
  {
    'age': 'ทุกเดือน',
    'vaccine': 'ป้องกันเห็บหมัดและ พยาธิหนอนหัวใจ',
    'dose': ' - ',
  },
  {
    'age': 'ทุก 3 เดือน',
    'vaccine': 'ถ่ายพยาธิ',
    'dose': ' - ',
  },
];

List<Map<String, String>> vaccinationDog = [
  {
    'age': '6 ',
    'vaccine': 'ถ่ายพยาธิ และตรวจสุขภาพ',
    'dose': ' - ',
  },
  {
    'age': '8 ',
    'vaccine': 'วัคซีนสุนัขรวม 5 โรค',
    'dose': 'เข็มที่ 1',
  },
  {
    'age': '12',
    'vaccine': 'วัคซีนสุนัขรวม 5 โรค',
    'dose': 'เข็มที่ 2',
  },
  {
    'age': '12',
    'vaccine': 'วัคซีนป้องกันพิษสุนัขบ้า',
    'dose': 'เข็มที่ 1',
  },
  {
    'age': '16',
    'vaccine': 'วัคซีนสุนัขรวม 5 โรค',
    'dose': 'เข็มที่ 3',
  },
  {
    'age': '16',
    'vaccine': 'วัคซีนป้องกันพิษสุนัขบ้า',
    'dose': 'เข็มที่ 2',
  },
];

List<Map<String, String>> vac_Dog = [
  {
    'age': '6 ขึ้นไป',
    'vaccine': 'วัคซีนป้องกันไข้หัดหวัดแมว',
    'dose': 'เข็มที่ 1',
  },
  {
    'age': '11-12',
    'vaccine': 'วัคซีนป้องกันไข้หัดหวัดแมว',
    'dose': 'เข็มที่ 2',
  },
  {
    'age': '12-14',
    'vaccine': 'วัคซีนป้องกันโรคพิษสุนัขบ้า',
    'dose': 'เข็มที่ 1',
  },
  {
    'age': '14-16',
    'vaccine': 'วัคซีนป้องกันไข้หัดหวัดแมว',
    'dose': 'เข็มที่ 3',
  },
  {
    'age': '16-20',
    'vaccine': 'วัคซีนป้องกันโรคพิษสุนัขบ้า',
    'dose': 'เข็มที่ 2',
  },
];

List<Map<String, String>> vac_Cat = [
  {
    'age': '6 ขึ้นไป',
    'vaccine': 'วัคซีนป้องกันไข้หัดหวัดแมว',
    'dose': 'เข็มที่ 1',
  },
  {
    'age': '11-12',
    'vaccine': 'วัคซีนป้องกันไข้หัดหวัดแมว',
    'dose': 'เข็มที่ 2',
  },
  {
    'age': '12-14',
    'vaccine': 'วัคซีนป้องกันโรคพิษสุนัขบ้า',
    'dose': 'เข็มที่ 1',
  },
  {
    'age': '14-16',
    'vaccine': 'วัคซีนป้องกันไข้หัดหวัดแมว',
    'dose': 'เข็มที่ 3',
  },
  {
    'age': '16-20',
    'vaccine': 'วัคซีนป้องกันโรคพิษสุนัขบ้า',
    'dose': 'เข็มที่ 2',
  },
];